; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-27)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 27
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 7 of 27
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 27
4. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 8 of 27
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 27
6. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 8 of 27
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 27
8. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 9 of 27
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 27
10. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 9 of 27
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 27
12. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 10 of 27
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 27
14. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 10 of 27
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 27
16. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 11 of 27
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 27
18. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 11 of 27
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 27
20. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 12 of 27
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 27
22. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 12 of 27
23. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 12 of 27
24. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 12 of 27
25. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 13 of 27
26. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 13 of 27
27. (pick ball27 room5 left)
   deleted: (at ball27 room5) (free left)
   added: (carry ball27 left)
   goals met: 13 of 27
28. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 13 of 27
29. (drop ball27 rooma left)
   deleted: (carry ball27 left)
   added: (at ball27 rooma) (free left)
   goals met: 14 of 27
30. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 14 of 27
31. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 14 of 27
32. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 14 of 27
33. (drop ball26 rooma left)
   deleted: (carry ball26 left)
   added: (at ball26 rooma) (free left)
   goals met: 15 of 27
34. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 15 of 27
35. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 15 of 27
36. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 15 of 27
37. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 15 of 27
38. (drop ball25 rooma left)
   deleted: (carry ball25 left)
   added: (at ball25 rooma) (free left)
   goals met: 16 of 27
39. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 16 of 27
40. (pick ball24 room4 left)
   deleted: (at ball24 room4) (free left)
   added: (carry ball24 left)
   goals met: 16 of 27
41. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 16 of 27
42. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 17 of 27
43. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 17 of 27
44. (pick ball23 room4 left)
   deleted: (at ball23 room4) (free left)
   added: (carry ball23 left)
   goals met: 17 of 27
45. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 17 of 27
46. (drop ball23 rooma left)
   deleted: (carry ball23 left)
   added: (at ball23 rooma) (free left)
   goals met: 18 of 27
47. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 18 of 27
48. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 18 of 27
49. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 18 of 27
50. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 19 of 27
51. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 19 of 27
52. (pick ball21 room4 left)
   deleted: (at ball21 room4) (free left)
   added: (carry ball21 left)
   goals met: 19 of 27
53. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 19 of 27
54. (drop ball21 rooma left)
   deleted: (carry ball21 left)
   added: (at ball21 rooma) (free left)
   goals met: 20 of 27
55. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 20 of 27
56. (pick ball20 room4 left)
   deleted: (at ball20 room4) (free left)
   added: (carry ball20 left)
   goals met: 20 of 27
57. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 20 of 27
58. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 21 of 27
59. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 21 of 27
60. (pick ball19 room4 left)
   deleted: (at ball19 room4) (free left)
   added: (carry ball19 left)
   goals met: 21 of 27
61. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 21 of 27
62. (drop ball19 rooma left)
   deleted: (carry ball19 left)
   added: (at ball19 rooma) (free left)
   goals met: 22 of 27
63. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 22 of 27
64. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 22 of 27
65. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 22 of 27
66. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 23 of 27
67. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 23 of 27
68. (pick ball17 room4 left)
   deleted: (at ball17 room4) (free left)
   added: (carry ball17 left)
   goals met: 23 of 27
69. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 23 of 27
70. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 23 of 27
71. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 24 of 27
72. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 24 of 27
73. (pick ball16 room3 left)
   deleted: (at ball16 room3) (free left)
   added: (carry ball16 left)
   goals met: 24 of 27
74. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 24 of 27
75. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 25 of 27
76. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 25 of 27
77. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 25 of 27
78. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 25 of 27
79. (drop ball15 rooma left)
   deleted: (carry ball15 left)
   added: (at ball15 rooma) (free left)
   goals met: 26 of 27
80. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 26 of 27
81. (pick ball14 room3 left)
   deleted: (at ball14 room3) (free left)
   added: (carry ball14 left)
   goals met: 26 of 27
82. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 26 of 27
83. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 27 of 27
